import type { IconProps } from "./types"

// icon / gitfork — 18. Other, набор ALL ICONS.
// 16 и 24 — отдельные начертания мастера, а не масштаб одного.
export function Gitfork({ size = 16, ...props }: IconProps) {
  if (size === 24) {
    return (
      <svg viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg" {...props}><path fill="currentColor" fillRule="evenodd" d="M17.626 4.75a1.625 1.625 0 1 0 0 3.25 1.625 1.625 0 0 0 0-3.25m-3.486.627a3.627 3.627 0 0 1 7.11.998 3.625 3.625 0 0 1-7.108 1.005A1.25 1.25 0 0 0 13 8.625v6.75a1.25 1.25 0 0 0 1.141 1.245 3.627 3.627 0 0 1 7.11 1.005 3.625 3.625 0 0 1-7.112.998A3.25 3.25 0 0 1 11 15.375V13H9.86a3.627 3.627 0 0 1-7.11-1 3.625 3.625 0 0 1 7.11-1H11V8.625a3.25 3.25 0 0 1 3.14-3.248m-7.765 4.998a1.625 1.625 0 1 0 0 3.25 1.625 1.625 0 0 0 0-3.25M17.625 16a1.625 1.625 0 1 0 0 3.25 1.625 1.625 0 0 0 0-3.25" clipRule="evenodd"/></svg>
    )
  }

  return (
    <svg viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg" {...props}><path fill="currentColor" d="M15 12a3 3 0 0 1-5.87.87A3 3 0 0 1 7 10v-.995h-.176A2.998 2.998 0 0 1 1 8a3 3 0 0 1 5.828-.995H7V6a3 3 0 0 1 2.13-2.871A3 3 0 1 1 12 7c-1.194 0-2.221-.7-2.704-1.709A1 1 0 0 0 9 6v4c0 .277.114.527.296.708A2.997 2.997 0 0 1 15 12M5 8a1 1 0 1 0-2 0 1 1 0 0 0 2 0m8-4a1 1 0 1 0-2 0 1 1 0 0 0 2 0m0 8a1 1 0 1 0-2 0 1 1 0 0 0 2 0"/></svg>
  )
}
